{"About the Company": "Elgi Equipments Ltd is engaged in the manufacturing of air compressors and automobile service station equipment.The products manufactured by the company has wide applications in the area of mining, pharmaceuticals, ship building, power, oil, chemicals, textiles, printing, paper, transport, electronics, telecommunications, defence, medical, railways, food and beverages and plastics.The product range of the company includes:Rotary Screw Air Compressors- Under this company designs and manufactures electric and diesel powered screw air compressor. Under this the company manufactures wide range of products such as electric powered screw air compressors, airends, oil-free screw air compressor, centrifugal air compressor and portable screw air compressor. The company has also manufactured the worlds smallest screw air compressor known as ELGI Micro Rotary. Reciprocating Air Compressors- Under this, EEL manufactures a range of compressors namely horizon series reciprocating air compressors, borewell compressors, ELGIPET air power systems, high pressure / volume reciprocating air compressors, high volume tank mounted compressors, tractor mounted air compressors, high pressure reciprocating air compressor and bare compressor pumps.Automotive Equipments- Under this the company manufactures equipments for two, three and four wheelers that provides a total service station solutions. The Company is engaged in the production of automoti", "address": {"address1": "Elgi Industrial Complex,", "address2": "Trichy Road,,Singanallur,", "city": "Coimbatore", "state": "Tamil Nadu", "pincode": "641005", "telephone1": "422-2589555", "telephone2": "", "fax1": "422-2573697", "fax2": "", "email": "investor@elgi.com", "web": "http://www.elgi.com"}, "management": [{"name": "Jairam Varadaraj", "designation": "Managing Director"}, {"name": "N Mohan Nambiar", "designation": "Non Executive Director"}, {"name": "B Vijayakumar", "designation": "Non Executive Director"}, {"name": "Sudarsan Varadaraj", "designation": "Non Executive Director"}, {"name": "Ganesh Devaraj", "designation": "Non Executive Director"}], "registrars": {"name": "Link Intime India Pvt. Ltd.", "address1": "Surya, 35, May Flower Avenue,", "address2": "Behind Senthil Nagar,,", "address3": "Sowripalyam Road,", "address4": "", "telephone": "0422-2310552, 2314792, 2315792", "fax": "0422-2316755", "email": "coimbatore@linkintime.co.in", "internet": "http://www.linkintime.co.in", "city": "Coimbatore", "state": "Tamil Nadu", "pincode": "641028"}, "listing": [{"name": "BSE 100", "value": "No"}, {"name": "BSE 200", "value": "No"}, {"name": "SENSEX", "value": "No"}, {"name": "CNX MIDCAP 200", "value": "Yes"}, {"name": "NIFTY 50", "value": "No"}, {"name": "BSE 500", "value": "Yes"}], "details": {"bseId": "522074", "nseId": "ELGIEQUIP", "series": "EQ", "isinid": "INE285A01027"}}