{"About the Company": "Disa India Ltd is engaged in the manufacturing of modern foundry equipments.The company supplies complete foundry systems by integrating the DISA range of moulding machines and sand mixers with proper combination of sand plant equipments, surface treatment machineries, environmental control systems and conveying systems. The product range offered by the company includes Moulding- offers solutions employing various moulding configurations - vertical moulding, horizontal moulding and matchplate moulding technology.They offer choice of the type and size of castings, according to the size of production runs, production facility requirements, and the amount of space available in the foundry.Sand technology- Modern sand technology begins with the specific treatment of used sand. The company offers an array of equipment to cover all stages of the process, such as cleaning, cooling, homogenizing and mixing, and also complete in-line and tower-type sand plants for all throughout capacities.Shot blast system- solutions include modern blast cleaning systems for foundries (desanding, decoring and surface finishing of iron and light metal castings) and for mechanical descaling of semi-finished or finished products in all branches of the steel producing and manufacturing industries. Shot peening is also provided.Core technology- Core shooting machines, Core handling systems (Robot systems, deburring, core assembly, coating technology, cor", "address": {"address1": "World Trade Center (WTC),", "address2": "6th Floor, Unit No. S-604,,Brigade Gateway Campus,", "city": "Bengaluru", "state": "Karnataka", "pincode": "560055", "telephone1": "80-22496700", "telephone2": "80-22496701", "fax1": "80-22496750", "fax2": "", "email": "investor.relations@noricangroup.com", "web": "http://www.disagroup.com"}, "management": [{"name": "Deepa Hingorani", "designation": "Chairperson"}, {"name": "Lokesh Saxena", "designation": "Managing Director"}, {"name": "Bhagya Chandra Rao", "designation": "Independent Director"}, {"name": "Ulla P Tonnesen", "designation": "Director"}, {"name": "Anders Wilhjelm", "designation": "Director"}], "registrars": {"name": "Integrated Registry Management Services Pvt. Ltd.", "address1": "#30, Ramana Residency, 4th Cross,\nSampige Road, Ma", "address2": "", "address3": "", "address4": "", "telephone": "080-23460815-818", "fax": "080-23460819", "email": "irg@integratedindia.in", "internet": "https://www.integratedindia.in", "city": "Bengaluru", "state": "Karnataka", "pincode": "560003"}, "listing": [{"name": "BSE 100", "value": "No"}, {"name": "BSE 200", "value": "No"}, {"name": "SENSEX", "value": "No"}, {"name": "CNX MIDCAP 200", "value": "No"}, {"name": "NIFTY 50", "value": "No"}, {"name": "BSE 500", "value": "No"}], "details": {"bseId": "500068", "nseId": "GEORGFISCH", "series": "", "isinid": "INE131C01011"}}