{"About the Company": "Elecon Engineering Company Ltd is engaged in delivering power transmission solutions and material handling equipment. The company caters to the needs of various sectors like steel, fertilisers, cement, coal, lignite and iron ore mines, sugar, power stations and port mechanization inIndiaand abroad. They have emerged as the largest gear manufacturing company inAsia.The company mainly operates through the following divisions:Power Transmission solutions- This division of company design and manufactures worm gears, parallel shaft and right angle shaft, helical and spiral bevel helical gears, fluid, geared and flexible couplings and planetary gear boxes. These products are supplied to sectors such as sugar, cement, chemical, fertilizer, steel, plastic extrusion and rubber.Material handling equipments- Under this, the company manufactures products such as belt conveyors, stacker-cum-reclaimers, pusher cars, idlers and pulleys, barrel type blender reclaimers, ship loaders and unloaders, stacker, bridge type bucket wheel reclaimers, crawler mounted bucket wheel excavators, wagon tipplers and side arm chargers, crushers and feeders. This division caters to the need of various industries such as steel, fertilizer, cement, coal, lignite and iron are mines, power stations and port mechnisation in India and abroad.Wind Power- Elecon manufactures wind turbines at the unit located at Vallabh Vidynagar in Gujarat. The company has ente", "address": {"address1": "Anand-Sojitra Road,", "address2": ",", "city": "Vallab Vidyanagar", "state": "Gujarat", "pincode": "388120", "telephone1": "02692-236469", "telephone2": "02692-236513", "fax1": "02692-227484", "fax2": "02692-227020", "email": "investor.relations@elecon.com", "web": "http://www.elecon.com"}, "management": [{"name": "Prayasvin B Patel", "designation": "Chairman & Managing Director"}, {"name": "Prashant C Amin", "designation": "Director"}, {"name": "Pradip M Patel", "designation": "Director"}, {"name": "Pranav C Amin", "designation": "Director"}, {"name": "Jai S Diwanji", "designation": "Director"}], "registrars": {"name": "Link Intime India Pvt. Ltd.", "address1": "B-102 &103, Shangrila Complex,", "address2": "1st Floor, Near Radhakrishna Char Rasta,,", "address3": "Akota,", "address4": "", "telephone": "0265-2356573, 2356794, 2252875, 2250241", "fax": "0265-2356791, 2250246", "email": "vadodara@linktime.co.in", "internet": "http://www.linkintime.co.in", "city": "Vadodra", "state": "Gujarat", "pincode": "390020"}, "listing": [{"name": "BSE 100", "value": "No"}, {"name": "BSE 200", "value": "No"}, {"name": "SENSEX", "value": "No"}, {"name": "CNX MIDCAP 200", "value": "No"}, {"name": "NIFTY 50", "value": "No"}, {"name": "BSE 500", "value": "No"}], "details": {"bseId": "505700", "nseId": "ELECON", "series": "EQ", "isinid": "INE205B01023"}}