{"About the Company": "Hindustan Aeronautics Limited manufactures and overhauls aircraft and helicopters worldwide. It offers aircraft, helicopters, communication/navigation equipment, advanced communication equipment, aerospace equipment, aero engines, advanced light helicopterweapon system integration, light combat aircraft, intermediate jet trainers, and light combat helicopters; and accessories for aircraft, helicopters, and aero engines. The company also provides satellite launch vehicles, such as polar satellite launch vehicles, geo-synchronous satellite launch vehicles, Indian remote satellites, and Indian national satellites. In addition, it manufactures and overhauls industrial marine gas turbines and composites; manufactures structural sub-assemblies, such as doors, pylons, fairings, drop tanks, control structures; designs and constructs engine test beds; and offers repairs, servicing, and supply of spares for military and civil aircraft and helicopters. Further, the company provides site repair, defect investigation/failure analysis, product training, product improvement modification, flight safety, and aircraft upgradation and life extension services; and scheduled and unscheduled servicing of helicopters, supply of ground handling and ground service equipment, assistance in investigations of accidents/incidents and defects, technical support, compliance of modification and technical instructions, and training services. Furthermore, it", "address": {"address1": "No: 15/1,", "address2": "Cubbon Road,,", "city": "Bengaluru", "state": "Karnataka", "pincode": "560001", "telephone1": "080-22320001", "telephone2": "", "fax1": "080-22320758", "fax2": "", "email": "investors@hal-india.co.in", "web": "http://www.hal-india.co.in"}, "management": [{"name": "C B Ananthakrishnan", "designation": "Director - Finance & CFO"}, {"name": "E P Jayadeva", "designation": "Director - Operations"}, {"name": "Atasi Baran Pradhan", "designation": "Director - Human Resources"}, {"name": "Divya Gupta", "designation": "Independent Director"}, {"name": "Deepak Abasaheb Shinde", "designation": "Independent Director"}], "registrars": {"name": "KFIN Technologies Pvt. Ltd.", "address1": "Selenium Tower B, Plot No. 31-32,", "address2": "Gachibowli, Financial District, \nNanakramguda,Seri", "address3": "", "address4": "", "telephone": "040-67161500, 67162222, 33211000", "fax": "040-23420814, 23001153", "email": "einward.ris@karvy.com", "internet": "http://www.kfintech.com", "city": "Hyderabad", "state": "Telangana", "pincode": "500032"}, "listing": [{"name": "BSE 100", "value": "Yes"}, {"name": "BSE 200", "value": "Yes"}, {"name": "SENSEX", "value": "No"}, {"name": "CNX MIDCAP 200", "value": "No"}, {"name": "NIFTY 50", "value": "No"}, {"name": "BSE 500", "value": "Yes"}], "details": {"bseId": "541154", "nseId": "HAL", "series": "EQ", "isinid": "INE066F01020"}}