{"About the Company": "Edelweiss Financial Services Ltd is a diversified financial services company in India, providing investment banking, institutional equities, private client broking, asset management and investment advisory services, wealth management, insurance broking and wholesale financing services to corporate, institutional and high net worth individual clients. The company`s business line can be broadly classified as:Investment Banking - The company provides full range of services and transaction expertise, including private placements of equity, capital raising services in public markets, mezzanine and convertible debt, mergers and acquisition and restructuring advisory services. These services are offered to corporations, entrepreneurs and investors.Institutional Equities - The companys subsidiary Edelweiss Securities is engaged in providing equity broking and research services, marketing of equity related products, including IPOs/FCCBs, to domestic and foreign institutional investors. They offer their services to clients who are leading domestic and international institutional investors, including pension funds, hedge funds, mutual funds, insurance companies and banks.Asset Management - Edelweiss Capital offers a range of investment products and advisory services in area of risk return spectrum to individual and institutional investors.Wealth Management - They offer a range of services in the area of portfolio management services,", "address": {"address1": "Edelweiss House,", "address2": "Off. C.S.T. Road,,Kalina,", "city": "Mumbai", "state": "Maharashtra", "pincode": "400098", "telephone1": "022-40795199", "telephone2": "", "fax1": "022-40863759", "fax2": "", "email": "efsl.shareholders@edelweissfin.com", "web": "http://www.edelweissfin.com"}, "management": [{"name": "Rashesh Shah", "designation": "Chairman & Managing Director"}, {"name": "Venkatchalam Ramaswamy", "designation": "Vice Chairman & Exe.Director"}, {"name": "Himanshu Kaji", "designation": "Executive Director"}, {"name": "Vidya Shah", "designation": "Non Exe.Non Ind.Director"}, {"name": "Shiva Kumar", "designation": "Independent Director"}], "registrars": {"name": "Link Intime India Pvt. Ltd.", "address1": "C 101, 247 Park,\nL.B.S. Marg, Vikhroli (West),", "address2": "", "address3": "", "address4": "", "telephone": "022-49186270, 49186200", "fax": "022-49186060", "email": "rnt.helpdesk@linkintime.co.in", "internet": "http://www.linkintime.co.in", "city": "Mumbai", "state": "Maharashtra", "pincode": "400083"}, "listing": [{"name": "BSE 100", "value": "No"}, {"name": "BSE 200", "value": "No"}, {"name": "SENSEX", "value": "No"}, {"name": "CNX MIDCAP 200", "value": "No"}, {"name": "NIFTY 50", "value": "No"}, {"name": "BSE 500", "value": "No"}], "details": {"bseId": "532922", "nseId": "EDELWEISS", "series": "EQ", "isinid": "INE532F01054"}}