{"About the Company": "Vesuvius India Ltd is a world leader in the design, engineering, manufacture and delivery of refractory products, systems and services for high-technology industrial applications.The different divisions of the company includes Iron & Steel Division-provides customers with a full range of products and systems for the continuous casting of steel.FOUNDRY Division- supplies ferrous and non-ferrous foundries as well as investment casting, with a wide range of refractories. Key products include monolithic and brick linings for furnaces, flow control products, crucibles used to melt and transfer molten metals, temperature measurement systems, dosing accessories, degassing products and ceramic filters which reduce flaws and control turbulent flow during mould filling.GLASS Division-supplies a wide range of special refractories for the Glass industry. Key products supplied by VESUVIUS to the glass industry include refractories used in both glass production and glass transformation installations.SOLAR Division-A key component for the mass production of multi crystal Solar Grade Silicon ingots is the availability of large ceramic crucibles in which ingots are manufactured.Almost two decades ago, VESUVIUS has developed a unique process to produce these complex ceramic parts on a commercial scale.MINERAL PROCESSING Division-VESUVIUS has a long experience in the supply of refractories to all areas of the cement production process, and to", "address": {"address1": "P-104, Taratala Road,", "address2": ",", "city": "Kolkata", "state": "West Bengal", "pincode": "700088", "telephone1": "033-61090500", "telephone2": "", "fax1": "033-24013976", "fax2": "", "email": "vesuviusindia@vesuvius.com", "web": "http://www.vesuviusindia.in"}, "management": [{"name": "Biswadip Gupta", "designation": "Chairman"}, {"name": "Nitin Jain", "designation": "Managing Director"}, {"name": "Nayantara Palchoudhuri", "designation": "Director"}, {"name": "Patrick Georges Felix Andre", "designation": "Director"}, {"name": "Sudipto Sarkar", "designation": "Director"}], "registrars": {"name": "C B Management Services Ltd.", "address1": "P-22, 2nd Floor,", "address2": "Bondel Road,", "address3": "", "address4": "", "telephone": "033-40116700, 22806692, 22806693, 22806694, 228024", "fax": "033-22870263", "email": "rta@cbmsl.com", "internet": "http://www.cbmsl.com", "city": "Kolkata", "state": "West Bengal", "pincode": "700019"}, "listing": [{"name": "BSE 100", "value": "No"}, {"name": "BSE 200", "value": "No"}, {"name": "SENSEX", "value": "No"}, {"name": "CNX MIDCAP 200", "value": "Yes"}, {"name": "NIFTY 50", "value": "No"}, {"name": "BSE 500", "value": "No"}], "details": {"bseId": "520113", "nseId": "VESUVIUS", "series": "EQ", "isinid": "INE386A01015"}}