{"About the Company": "Kosian Industries Limited, an investment company, provides advisory and consultancy services on various matters and problems relating to finance, investment, administration, management, system of accounts, internal audit/control system, taxation, secretarial work, project reporting and planning, financial from financial institution and bankers, marketing, and distributing. The company invests monies of companies on securities of or in the purchase and acquisition of stocks, shares, units, bonds, debentures, debenture stock, obligation, mortgages, and securities of government, state, and municipality, or of various companies or corporations; and subscribes for securities and hold, sell, exchange, and deal in shares, stocks, bonds, units, debenture, debenture stock, obligation, mortgages or securities of government, public authorities, or companies. It serves clients in India and internationally. Kosian Industries Limited was formerly known as Kosian Finance Ltd. and changed its name to Kosian Industries Limited in December 2000. Kosian Industries Ltd. is engaged in the business of non-banking financial services such as trading in shares and securities, investment, loans, advances. They provide finance and investment services of project advisory services, merchant banking, loan syndication or bill discounting. They also do business in software trading. This company provides its financial service through a separat", "address": {"address1": "Ground Floor, Daya Sarita, \nC Wing,", "address2": "Gokul Dham, \nOpp RBI Quarters,,\nGoregaon East,", "city": "Mumbai", "state": "Maharashtra", "pincode": "400063", "telephone1": "022-67300585", "telephone2": "022-28701084", "fax1": "022-66541314", "fax2": "", "email": "compliancesevenhill@gmail.com", "web": "http://www.kosianindustries.com"}, "management": [{"name": "Rajkumar Popatlal Shingvi", "designation": "Director"}, {"name": "Samiksha Shingvi", "designation": "Director"}, {"name": "Niraj Vaghela", "designation": "Director"}, {"name": "Gunjan Shah", "designation": "WholeTime Director & CFO"}], "registrars": {"name": "Satellite Corporate Services Pvt. Ltd", "address1": "Office No 106 & 107, Dattani Plaza,", "address2": "East West Compound,,", "address3": "Andheri Kurla Road,", "address4": "Sakinaka,", "telephone": "022-28520461, 28520462", "fax": "022-28511809", "email": "info@satellitecorporate.com", "internet": "", "city": "Mumbai", "state": "Maharashtra", "pincode": "400072"}, "listing": [{"name": "BSE 100", "value": "No"}, {"name": "BSE 200", "value": "No"}, {"name": "SENSEX", "value": "No"}, {"name": "CNX MIDCAP 200", "value": "No"}, {"name": "NIFTY 50", "value": "No"}, {"name": "BSE 500", "value": "No"}], "details": {"bseId": "511760", "nseId": "", "series": "", "isinid": "INE518D01025"}}